#ifndef TEST_CLASS
#define TEST_CLASS
//---------------------------------------------------------------------------

class test
{
        public:

        int pr_tst; //“ип используемой обучающей оболочки 1 - Mentor, 2 - REDCLASS (сейчас не используетс€)
        int ch_ask; // оличество вариантов ответов в тесте
        int right_ask; //Ќомер правильного ответа
        AnsiString msg; //¬спомогательное сообщение (сейчас не используетс€)

        test()
        {
                pr_tst = 0;
                ch_ask = 0;
                right_ask = 0;
                msg = "";
        };
};
//---------------------------------------------------------------------------

#endif
//---------------------------------------------------------------------------
